# Задание 1

In [227]:
import pandas

In [229]:
rating_movie = pd.read_csv('ratings.csv')

# Задание 2

In [228]:
data_ = pandas.read_csv('power.csv')
data_.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [109]:
filtered_countries = data_[(data_['country'] == 'Latvia') | (data_['country'] == 'Lithuania') | (data_['country'] == 'Estonia')]
filtered_categories = filtered_countries[(filtered_countries['category'] == 4) | (filtered_countries['category'] == 12) | (filtered_countries['category'] == 21)]
filtered_years = filtered_categories[(filtered_categories['year'] == 2005) | (filtered_categories['year'] == 2006) | (filtered_categories['year'] == 2007) | (filtered_categories['year'] == 2008) | (filtered_categories['year'] == 2009) | (filtered_categories['year'] == 2010)]
filtered_years.head()

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4

In [117]:
common_quantity = 0

for el in filtered_years['quantity']:
    if el > 0:
        common_quantity += el
common_quantity

240580.0

# Задание 1

In [128]:
rating_movie = pd.read_csv('ratings.csv')

In [220]:
rating_5 = rating_movie[rating_movie['rating'] == 5] #отфильтровала список по рейтингу 5
rating_5.head()

       userId  movieId  rating   timestamp
5555       40        1     5.0   832058959
9157       63        1     5.0  1443199669
23864     166        1     5.0  1189980529
32052     220        1     5.0  1230055565
11728      71        1     5.0   864737933

In [200]:
dict_ = {}
for el in rating_by_movieId['movieId']:
    if el not in dict_.keys():
        dict_.setdefault(el, 1)
    else:
        dict_[el] += 1
        
for k,v in dict_.items():
    if v == max(dict_.values()):
        print(k)

318

# Задание 3

In [224]:
fail_ = pd.read_html('https://www.finanz.ru/valyuty/v-realnom-vremeni', encoding = 'utf-8')
fail_[0]

,0,1,2,3,4,5,6,7,8,9,10,11
0,ММВБ,2 896,"1,2%",Nasdaq,11 895,"0,0%",Биткойн,15 372,"-0,7%",USD/RUB,774815,"0,2%"
1,РТС,1 178,"0,6%",S&P500,3 509,"0,0%",Нефть,405,"2,3%",EUR/RUB,918930,"0,0%"
2,Dow,28 323,"-0,2%",FTSE100,5 910,"0,1%",Золото,1 961,"0,2%",EUR/USD,11891,"0,0%"